In [ ]:
### Git hub Practice

# jst for test

============================== Packages for EDA(Exploratory Data Analisys) ==================================
1) Pandas : used for Data frame applications (how to read, write, modify data etc)
2) Numpy : Numerical python (all math applications are done)
3) Matplotlib : used for plotting
4) Seaborn : used for plotting
5) Plotly : used for plotting
6) Bokhe : for plotting

============================== Machine Learning =====================================

7) Scikit-learn: sklearn

============================= Deep Learning ==============================

8) Tensorflow : developed by google
9) Keras : google
10) Pytorch : facebook

=========================== NLP ==============================

11) NLTK : Natural language tool kit
12) Scipy

=========================== BERT (Bidirectional encoder representational tranformers) ================================

13) Transformers : Hugging face(acquired by google)

========================= Google models =============================

14) Google specific pacakges

======================= Azure ML =============================

15) Azure packages

======================= Gen AI ===========================

16) Gemini : google
17) ChatGPT : OpenAI

============================= LangChain ==================================

18) LangChain Packages

**Create a Data frame using list**

$Step-1$:

**Create a dataframe**

In [1]:
import pandas as pd
names = ['vidya','lalith', 'jaya']
pd.DataFrame() # empty dataframe is created (no rows no columns)
# dataframe will have rows and columns

Empty DataFrame
Columns: []
Index: []

$Step-2$

**Provide the data**

In [3]:
names = ['vidya','lalith','jaya']
pd.DataFrame(names)

        0
0   vidya
1  lalith
2    jaya

In [4]:
age = [20,25,21]
pd.DataFrame(age)

    0
0  20
1  25
2  21

In [8]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
pd.DataFrame(names, age)
# what is the 1st positional argument? Ans: Data
# what is the 2nd positional argument? Ans:index
# so here the age is taken as index automatically

         0
20   vidya
25  lalith
21    jaya

In [9]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
pd.DataFrame(zip(names, age))
# what is the 1st positional argument? Ans: Data
# what is the 2nd positional argument? Ans:index
# so here the age is taken as index automatically
# so do zip the input data, so it will be considered as a whole one

        0   1
0   vidya  20
1  lalith  25
2    jaya  21

In [10]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
city = ['hyd','chennai','blr']
pd.DataFrame(zip(names, age,city))

        0   1        2
0   vidya  20      hyd
1  lalith  25  chennai
2    jaya  21      blr

In [14]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
city = ['hyd','chennai','blr']
data = zip(names, age,city)
pd.DataFrame(data)

        0   1        2
0   vidya  20      hyd
1  lalith  25  chennai
2    jaya  21      blr

In [12]:
names = ['vidya','lalith','jaya']
age = [20,25]
city = ['hyd','chennai','blr']
pd.DataFrame(zip(names, age,city))
# if sizes are not equal we get mini size of output

        0   1        2
0   vidya  20      hyd
1  lalith  25  chennai

$Step-3$

**Provide the column names**

In [13]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
city = ['hyd','chennai','blr']
pd.DataFrame(zip(names, age,city), columns=['names','age','city'])

    names  age     city
0   vidya   20      hyd
1  lalith   25  chennai
2    jaya   21      blr

In [16]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
city = ['hyd','chennai','blr']

data = zip(names, age,city)
cols = ['names','age','city']
pd.DataFrame(data, columns=cols)

    names  age     city
0   vidya   20      hyd
1  lalith   25  chennai
2    jaya   21      blr

$Step-4$

**Add new column for already exsisting dataframe**

In [17]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
city = ['hyd','chennai','blr']

data = zip(names, age,city)
cols = ['names','age','city']
df = pd.DataFrame(data, columns=cols)

In [18]:
type(df)

pandas.core.frame.DataFrame

- To add new column in existed data
- You need to check the number of rows in already existed data
- For example: In above, dataframe has 3 rows
- You need to create a new list with 3 rows
- That list equate to dataframe

In [20]:
job = ['DS','DE','CS']
df['job'] = job
df

# we can simply give list directly
# df['job'] = ['DS','DE','CS']
# df

    names  age     city job
0   vidya   20      hyd  DS
1  lalith   25  chennai  DE
2    jaya   21      blr  CS

$Step - 5$

**To change/update any column values in existing column**

- creating and updating column are same

In [21]:
df['age'] = [25,24,23]
df

    names  age     city job
0   vidya   25      hyd  DS
1  lalith   24  chennai  DE
2    jaya   23      blr  CS

$Step - 6$

**How to change the index**

In [23]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
city = ['hyd','chennai','blr']

data = zip(names, age,city)
cols = ['names','age','city']
idx = ['A','B','C']

df = pd.DataFrame(data, idx, columns=cols)
df

    names  age     city
A   vidya   20      hyd
B  lalith   25  chennai
C    jaya   21      blr

**Note**
  
- no. of list = no. of columns
- no. of values inside list = no. of rows
- when you create data all the lists should be of same length

$Step-7$

**Shape**
- shape means number of rows, number od coulmns

In [25]:
df.shape
# matric format (3*3)
print("the number of rows are: ",df.shape[0])
print("the number of rows are: ",df.shape[1])

the number of rows are:  3
the number of rows are:  3

$Step-8$

**Drop the column**

- In order to drop a column, we need 3 parameters
- Column name
    - which column we need to drop that column name
- axis
    - axis = 0 means **rows**
    - axis = 1 means **column**
      
- inplace
    - we are droping the column means we modifying the dataframe
    - so this modifications we want to save in same varilabe or in different varibale
    - if you want to keep in same variable then **inplace = True**

In [37]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
city = ['hyd','chennai','blr']

data = zip(names, age,city)
cols = ['names','age','city']
df = pd.DataFrame(data, columns=cols)

job = ['DS','DE','CS']
df['job'] = job
df

    names  age     city job
0   vidya   20      hyd  DS
1  lalith   25  chennai  DE
2    jaya   21      blr  CS

In [38]:
df.drop('job',axis = 1, inplace = True)

In [39]:
df

    names  age     city
0   vidya   20      hyd
1  lalith   25  chennai
2    jaya   21      blr

In [40]:
df1 = df.drop('city',axis = 1)
# here inplace is not True, so df wont be updated with dropped column

In [41]:
df

    names  age     city
0   vidya   20      hyd
1  lalith   25  chennai
2    jaya   21      blr

In [42]:
df1

    names  age
0   vidya   20
1  lalith   25
2    jaya   21

$Step-9$

**Drop multiple columns**

In [43]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
city = ['hyd','chennai','blr']

data = zip(names, age,city)
cols = ['names','age','city']
df = pd.DataFrame(data, columns=cols)

job = ['DS','DE','CS']
df['job'] = job
df

    names  age     city job
0   vidya   20      hyd  DS
1  lalith   25  chennai  DE
2    jaya   21      blr  CS

In [44]:
df.drop(['city','job'], axis = 1, inplace = True)

In [45]:
df

    names  age
0   vidya   20
1  lalith   25
2    jaya   21

$Step-10$

**Drop the rows**

In [46]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
city = ['hyd','chennai','blr']

data = zip(names, age,city)
cols = ['names','age','city']
df = pd.DataFrame(data, columns=cols)

job = ['DS','DE','CS']
df['job'] = job
df

    names  age     city job
0   vidya   20      hyd  DS
1  lalith   25  chennai  DE
2    jaya   21      blr  CS

In [47]:
df.drop(0,axis = 0, inplace = True)

In [48]:
df

    names  age     city job
1  lalith   25  chennai  DE
2    jaya   21      blr  CS

$Step-11$

**How to save the dataframe**

- Generally  dataframes are 2 types
   - csv (comma seperated val)
   - excel

In [49]:
names = ['vidya','lalith','jaya']
age = [20,25,21]
city = ['hyd','chennai','blr']

data = zip(names, age,city)
cols = ['names','age','city']
df = pd.DataFrame(data, columns=cols)

job = ['DS','DE','CS']
df['job'] = job
df

    names  age     city job
0   vidya   20      hyd  DS
1  lalith   25  chennai  DE
2    jaya   21      blr  CS

In [50]:
# filename = edaData
# extension =.csv

df.to_csv('edaData.csv')

In [56]:
df.to_csv('edaData2.csv', index = False)

In [54]:
# filename = edaData
# extension =.xlsx

df.to_excel('edaDataexcel.xlsx')

In [55]:
df.to_excel('edaDataexcel1.xlsx', index = False)